duxinglang-1/nRF9160_test/E2_V3_IMU_TEST/src/imu/lsm6dso.c
static uint8_t init_i2c(void)
{
	i2c_imu = device_get_binding(IMU_DEV);
	if(!i2c_imu)
	{
	#ifdef IMU_DEBUG
		LOGD("ERROR SETTING UP I2C");
	#endif
		return -1;
	}
	else
	{
		i2c_configure(i2c_imu, I2C_SPEED_SET(I2C_SPEED_FAST));
		return 0;
	}
}

static int32_t platform_write(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;
	uint8_t data[len+1];

	data[0] = reg;
	memcpy(&data[1], bufp, len);
	rslt = i2c_write(i2c_imu, data, len+1, LSM6DSO_I2C_ADD);

	return rslt;
}

static int32_t platform_read(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;

	rslt = i2c_write(i2c_imu, &reg, 1, LSM6DSO_I2C_ADD);
	if(rslt == 0)
	{
		rslt = i2c_read(i2c_imu, bufp, len, LSM6DSO_I2C_ADD);
	}

	return rslt;
}

void interrupt_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
	int2_event = true;
}

void step_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
	int1_event = true;
}

void init_imu_int1(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_DOWN;

	if(gpio_imu == NULL)
		gpio_imu = device_get_binding(IMU_PORT);
	gpio_pin_configure(gpio_imu, LSM6DSO_INT1_PIN, flag);
}

uint8_t init_gpio(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_DOWN;

	if(gpio_imu == NULL)
		gpio_imu = device_get_binding(IMU_PORT);
	
	//steps&tilt interrupt
	gpio_pin_configure(gpio_imu, LSM6DSO_INT1_PIN, flag);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT1_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb1, step_event, BIT(LSM6DSO_INT1_PIN));
	gpio_add_callback(gpio_imu, &gpio_cb1);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT1_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_RISING);

#ifdef CONFIG_FALL_DETECT_SUPPORT
	//fall interrupt
	gpio_pin_configure(gpio_imu, LSM6DSO_INT2_PIN, flag);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT2_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb2, interrupt_event, BIT(LSM6DSO_INT2_PIN));
	gpio_add_callback(gpio_imu, &gpio_cb2);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT2_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_RISING);
#endif

	return 0;
}

void getActivityLibVer(void)
{
	MotionAW_GetLibVersion(lib_ver);
#ifdef IMU_DEBUG
	LOGD("Activity Library Version is: %s\n", lib_ver);
#endif
}

void getStepLibVer(void)
{
	MotionPW_GetLibVersion(lib_ver);
#ifdef IMU_DEBUG
	LOGD("Step Library Version is: %s\n", lib_ver);
#endif
}

void getSleepLibVer(void)
{
	MotionSM_GetLibVersion(lib_ver);
#ifdef IMU_DEBUG
	LOGD("Sleep Library Version is: %s\n", lib_ver);
#endif
}

void setOrientationAW(void)
{
	char acc_orientation[3];

	acc_orientation[0] = 'n';
	acc_orientation[1] = 'e';
	acc_orientation[2] = 'u';

	MotionAW_SetOrientation_Acc(acc_orientation);
}

void setOrientationSM(void)
{
	const char orientation[4] = "neu";

	MotionSM_SetOrientation_Acc(orientation);
}

void initActivityLib(void)
{
	MotionAW_Reset();
	MotionAW_Reset_Activity_Duration();
	MotionAW_Initialize();
	setOrientationAW();
}

void initSleepLib(void)
{
	MotionSM_Reset();
	MotionSM_Initialize();
	setOrientationSM();
}

void initStepLib(void)
{
	MotionPW_ResetStepCount();
	MotionPW_ResetPedometerLibrary();
	MotionPW_Initialize();
}

int runActivityAlgorithms(float accX, float accY, float accZ)
{
	MAW_input_t MAW_data_in = {.AccX = 0.0f, .AccY = 0.0f, .AccZ = 0.0f};
	MSM_input_t MSM_data_in = {.AccX = 0.0f, .AccY = 0.0f, .AccZ = 0.0f};
	MAW_output_t MAW_data_out;

	static int32_t activity_conversion = 0;
	static uint8_t resampling = 0;

	MAW_data_in.AccX = MPW_data_in.AccX = MSM_data_in.AccX = accX;
	MAW_data_in.AccY = MPW_data_in.AccY = MSM_data_in.AccY = accY;
	MAW_data_in.AccZ = MPW_data_in.AccZ = MSM_data_in.AccZ = accZ;

	// Get current activity
	MotionAW_Update(&MAW_data_in, &MAW_data_out, timeStamp);
#ifdef IMU_DEBUG
	LOGD("MAW Current Activity: %d\n", MAW_data_out.current_activity);
#endif

	// Convert current activity number
	activity_conversion = (int32_t)MAW_data_out.current_activity - 4;
	if(activity_conversion <= (int32_t)MPW_UNKNOWN_ACTIVITY || activity_conversion > (int32_t)MPW_JOGGING)
	{
		activity_conversion = (int32_t)MPW_UNKNOWN_ACTIVITY;
	}

	MPW_data_in.CurrentActivity = (MPW_activity_t)activity_conversion;
#ifdef IMU_DEBUG
	LOGD("MPW Current Activity: %d\n", MPW_data_in.CurrentActivity);
#endif

#ifdef CONFIG_STEP_SUPPORT
	MotionPW_Update(&MPW_data_in, &MPW_data_out);
#endif

#if 0	//xb test 2023.04.23 使用春晖睡眠算法
	resampling++;
	if(resampling == 3U)
	{
		if((date_time.hour >= SLEEP_TIME_START) || (date_time.hour < SLEEP_TIME_END))
		{
			if((date_time.hour == SLEEP_TIME_START)&&(date_time.minute == 0))//正式启动当天睡眠监测，清空上一天的数据
			{
				last_light_sleep = 0;
				last_deep_sleep = 0;
				light_sleep_time = 0;
				deep_sleep_time = 0;
				g_light_sleep = 0;
				g_deep_sleep = 0;

				initSleepLib();
			}
			else
			{
			#ifdef CONFIG_SLEEP_SUPPORT
				MotionSM_Update(&MSM_data_in, &MSM_data_out);
			#ifdef IMU_DEBUG
				LOGD("Sleep Flag: %d\n", MSM_data_out.SleepFlag);
				LOGD("Total Sleep Time: %d\n", MSM_data_out.TotalSleepTime);
			#endif
				total_SleepTime = MSM_data_out.TotalSleepTime;
			#endif
				g_deep_sleep = last_deep_sleep + total_SleepTime/60;
			}

			last_sport.timestamp.year = date_time.year;
			last_sport.timestamp.month = date_time.month; 
			last_sport.timestamp.day = date_time.day;
			last_sport.timestamp.hour = date_time.hour;
			last_sport.timestamp.minute = date_time.minute;
			last_sport.timestamp.second = date_time.second;
			last_sport.timestamp.week = date_time.week;
			last_sport.deep_sleep = g_deep_sleep;
			last_sport.light_sleep = g_light_sleep;
			save_cur_sport_to_record(&last_sport);			
		}
		
		resampling = 0;
	}
#endif

	// Get current activity
	/*MotionAW_Update(&MAW_data_in, &MAW_data_out, timeStamp);
#ifdef IMU_DEBUG
	LOGD("MAW Current Activity: %d\n", MAW_data_out.current_activity);
#endif

	activity_conversion = (int32_t)MAW_data_out.current_activity;
	if(activity_conversion <= (int32_t)MAW_LYING || activity_conversion >= (int32_t)MAW_BIKING)
	{
		activity_conversion = (int32_t)MPW_UNKNOWN_ACTIVITY;
		MPW_data_in.CurrentActivity = (MPW_activity_t)activity_conversion;
	}
	else if(activity_conversion == (int32_t)MAW_WALKING)// || MAW_data_out.current_activity == MAW_FASTWALKING || MAW_data_out.current_activity == MAW_JOGGING)
	{
		activity_conversion = (int32_t)MPW_WALKING;
		MPW_data_in.CurrentActivity = (MPW_activity_t)activity_conversion;
		MotionPW_Update(&MPW_data_in, &MPW_data_out);
	}*/

	timeStamp += (int64_t)reportInterval;

#ifdef IMU_DEBUG
	LOGD("Steps: %d", MPW_data_out.Nsteps);
	//LOGD("Cadence: %d\n", MPW_data_out.Cadence);
	//LOGD("Confidence: %d\n", MPW_data_out.Confidence);
#endif

